# SETUP

In [19]:
import pandas as pd
import numpy as np

%matplotlib inline

# Week 2 Activity

## Instructions

***If you have any issues, please visit the help section of the course.***

***To reset all of the outputs, use the menu to go to Cell -> All Output -> Clear***

**For this assignment, make sure to start from the top and work down**

1) First, import the studentinfo.csv dataset into R as a data frame named D1. To do so, click on the cell below and press Shift + Enter

```
D1 <- read.csv("studentInfo.csv", header=TRUE)
```

In [4]:
file = '/Users/quartz/Google 드라이브/learning_analytics/learning_analytics_fundamentals/studentInfo.csv'
D1 = pd.read_csv(file)
D1.tail()

,code_module,code_presentation,id_student,gender,region,highest_education,imd_band,age_band,num_of_prev_attempts,studied_credits,disability,final_result
32588,GGG,2014J,2640965,F,Wales,Lower Than A Level,10-20,0-35,0,30,N,Fail
32589,GGG,2014J,2645731,F,East Anglian Region,Lower Than A Level,40-50%,35-55,0,30,N,Distinction
32590,GGG,2014J,2648187,F,South Region,A Level or Equivalent,20-30%,0-35,0,30,Y,Pass
32591,GGG,2014J,2679821,F,South East Region,Lower Than A Level,90-100%,35-55,0,30,N,Withdrawn
32592,GGG,2014J,2684003,F,Yorkshire Region,HE Qualification,50-60%,35-55,0,30,N,Distinction

2) Create a new dataframe from `D1` that only contains the student ID and the presentation for students from Ireland, again by clicking the cell below and pressing Shift + Enter. As with last week's assignment, you will see some text on a light red background that says "Attaching package: 'dplyr'". You can ignore the text with the red background

```
library(dplyr)
D2 <- filter(D1, region == "Ireland")
D2 <- select(D2, id_student, code_presentation)
D2
```

In [5]:
D2 = D1[D1.region == "Ireland"]
D2 = D2[['id_student', 'code_presentation']]
D2.head()

    id_student code_presentation
17       71361             2013J
28      104476             2013J
65      172112             2013J
66      172797             2013J
88      227517             2013J

3) Create a new variable (column) called “count” that only contains the number 1 for each entry.

```
D2$count <- 1
```

In [6]:
D2['count'] = 1
D2.head()

    id_student code_presentation  count
17       71361             2013J      1
28      104476             2013J      1
65      172112             2013J      1
66      172797             2013J      1
88      227517             2013J      1

4) Using the “spread” function from the “tidyr” package, create a new data frame `D3` in wide format. There will be a column for the student ID number, and one column for each registration date. The columns for each registration date should contain the value 1 if the student on that row registered for that date, and the value NA if they did not.

```
library(tidyr)
D2 <- unique(D2)
D2 <- spread(D2, code_presentation, count)
D2
```

5) Next, remove missing data by listwise deletion using `na.omit()`. This will remove rows that contain any `NA` values.

```
D3 <- na.omit(D2)
D3
```

6) Find the ID number for the student that participated in all four courses and enter it in edX.

In [12]:
# find Nan Value

D2.isna().sum()

id_student           0
code_presentation    0
count                0
dtype: int64

In [18]:
D2.shape

(1184, 3)

In [11]:
len(np.unique(D2.id_student)), len(np.unique(D2.code_presentation))

(1072, 4)

In [21]:
# group by 'code_presentation'

D2.groupby(by='code_presentation').count()

                   id_student  count
code_presentation
2013B                     184    184
2013J                     347    347
2014B                     211    211
2014J                     442    442

---

### EDA

In [5]:
D1.tail()

,code_module,code_presentation,id_student,gender,region,highest_education,imd_band,age_band,num_of_prev_attempts,studied_credits,disability,final_result
32588,GGG,2014J,2640965,F,Wales,Lower Than A Level,10-20,0-35,0,30,N,Fail
32589,GGG,2014J,2645731,F,East Anglian Region,Lower Than A Level,40-50%,35-55,0,30,N,Distinction
32590,GGG,2014J,2648187,F,South Region,A Level or Equivalent,20-30%,0-35,0,30,Y,Pass
32591,GGG,2014J,2679821,F,South East Region,Lower Than A Level,90-100%,35-55,0,30,N,Withdrawn
32592,GGG,2014J,2684003,F,Yorkshire Region,HE Qualification,50-60%,35-55,0,30,N,Distinction

In [7]:
# dependent variable

D1.final_result.value_counts()

Pass           12361
Withdrawn      10156
Fail            7052
Distinction     3024
Name: final_result, dtype: int64

In [12]:
# data type : int64 - id_student, num_of_prev_attempts, studied_credits

D1.dtypes

code_module             object
code_presentation       object
id_student               int64
gender                  object
region                  object
highest_education       object
imd_band                object
age_band                object
num_of_prev_attempts     int64
studied_credits          int64
disability              object
final_result            object
dtype: object

In [13]:
# Nan Value

D1.isna().sum()

code_module                0
code_presentation          0
id_student                 0
gender                     0
region                     0
highest_education          0
imd_band                1111
age_band                   0
num_of_prev_attempts       0
studied_credits            0
disability                 0
final_result               0
dtype: int64

In [9]:
# How many student?

n = len(np.unique(D1.id_student))
print("The number of students is %d" % (n))

The number of students is 28785

In [21]:
# Gender ratio

D1.gender.value_counts()

M    17875
F    14718
Name: gender, dtype: int64

In [23]:
# region

D1.region.value_counts()

Scotland                3446
East Anglian Region     3340
London Region           3216
South Region            3092
North Western Region    2906
West Midlands Region    2582
South West Region       2436
East Midlands Region    2365
South East Region       2111
Wales                   2086
Yorkshire Region        2006
North Region            1823
Ireland                 1184
Name: region, dtype: int64

In [24]:
# highest education

D1.highest_education.value_counts()

A Level or Equivalent          14045
Lower Than A Level             13158
HE Qualification                4730
No Formal quals                  347
Post Graduate Qualification      313
Name: highest_education, dtype: int64

In [25]:
# IMD band

D1.imd_band.value_counts()

20-30%     3654
30-40%     3539
10-20      3516
0-10%      3311
40-50%     3256
50-60%     3124
60-70%     2905
70-80%     2879
80-90%     2762
90-100%    2536
Name: imd_band, dtype: int64

In [27]:
# age band

D1.age_band.value_counts()

0-35     22944
35-55     9433
55<=       216
Name: age_band, dtype: int64

In [11]:
# How many presentation

D1.code_presentation.value_counts()

2014J    11260
2013J     8845
2014B     7804
2013B     4684
Name: code_presentation, dtype: int64

In [29]:
# num of prev attempts

D1.num_of_prev_attempts.value_counts()

0    28421
1     3299
2      675
3      142
4       39
5       13
6        4
Name: num_of_prev_attempts, dtype: int64

In [30]:
# study of credits

D1.studied_credits.value_counts()

60     16751
120     6328
30      3749
90      3144
180      830
150      769
240      220
210      169
75       108
70        96
270       45
130       38
45        36
135       35
100       30
300       29
80        26
40        22
160       14
105       13
330       12
110       11
195       11
165        9
220        9
50         7
145        7
170        6
190        6
360        6
       ...
140        5
85         4
200        3
95         3
55         3
225        3
250        3
280        3
205        2
310        2
400        2
430        1
480        1
370        1
175        1
65         1
235        1
355        1
420        1
325        1
155        1
540        1
390        1
630        1
215        1
255        1
345        1
585        1
315        1
655        1
Name: studied_credits, Length: 61, dtype: int64

In [6]:
# How many module

D1.code_module.value_counts()

BBB    7909
FFF    7762
DDD    6272
CCC    4434
EEE    2934
GGG    2534
AAA     748
Name: code_module, dtype: int64

In [31]:
# disability

D1.disability.value_counts()

N    29429
Y     3164
Name: disability, dtype: int64

---

### preprocessing

In [32]:
print("Before : %d" % (len(D1)))
D1.dropna(inplace=True)
print("After : %d" % (len(D1)))

Before : 32593
After : 31482

##### X, y

In [37]:
y = D1['final_result']
X = D1.drop(['id_student', 'final_result'], axis=1)

y.shape, X.shape

((31482,), (31482, 10))

##### OHE

In [38]:
X.columns

Index(['code_module', 'code_presentation', 'gender', 'region',
       'highest_education', 'imd_band', 'age_band', 'num_of_prev_attempts',
       'studied_credits', 'disability'],
      dtype='object')

In [45]:
from sklearn.preprocessing import OneHotEncoder

encoder = OneHotEncoder()
data = encoder.fit_transform(X)
data = data.toarray()
columns = encoder.get_feature_names()

X = pd.DataFrame(data=data, columns=columns)
X.tail()

,x0_AAA,x0_BBB,x0_CCC,x0_DDD,x0_EEE,x0_FFF,x0_GGG,x1_2013B,x1_2013J,x1_2014B,...,x8_390,x8_400,x8_420,x8_430,x8_540,x8_585,x8_630,x8_655,x9_N,x9_Y
31477,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0
31478,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0
31479,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0
31480,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0
31481,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0

##### train, test split

In [47]:
from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)
X_train.shape, X_test.shape, y_train.shape, y_test.shape

((25185, 112), (6297, 112), (25185,), (6297,))

---

### modeling

##### decision tree (naive)

In [63]:
from sklearn.tree import DecisionTreeClassifier
from sklearn.metrics import classification_report

tree = DecisionTreeClassifier()
model = tree.fit(X_train, y_train)
y_pred = model.predict(X_test)
print(classification_report(y_test, y_pred))

              precision    recall  f1-score   support

 Distinction       0.14      0.17      0.16       609
        Fail       0.24      0.28      0.26      1354
        Pass       0.39      0.40      0.40      2339
   Withdrawn       0.39      0.33      0.36      1995

   micro avg       0.33      0.33      0.33      6297
   macro avg       0.29      0.29      0.29      6297
weighted avg       0.34      0.33      0.33      6297